<a href="https://colab.research.google.com/github/pantchayan/Machine-Learning-Labs/blob/master/titanicDataProcessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('titanic.csv')

In [3]:
data.head(10)

   pclass  survived  ... body                        home.dest
0       1         1  ...    ?                     St Louis, MO
1       1         1  ...    ?  Montreal, PQ / Chesterville, ON
2       1         0  ...    ?  Montreal, PQ / Chesterville, ON
3       1         0  ...  135  Montreal, PQ / Chesterville, ON
4       1         0  ...    ?  Montreal, PQ / Chesterville, ON
5       1         1  ...    ?                     New York, NY
6       1         1  ...    ?                       Hudson, NY
7       1         0  ...    ?                      Belfast, NI
8       1         1  ...    ?              Bayside, Queens, NY
9       1         0  ...   22              Montevideo, Uruguay

[10 rows x 14 columns]

In [4]:
data.replace('?',np.nan,inplace=True)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   object
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    object
 13  home.dest  745 non-null    object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

In [6]:
dropping = ['cabin','boat','body','home.dest']

for i in dropping:
  data.drop(i,axis=1,inplace=True)

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   survived  1309 non-null   int64
 2   name      1309 non-null   object
 3   sex       1309 non-null   object
 4   age       1046 non-null   object
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   ticket    1309 non-null   object
 8   fare      1308 non-null   object
 9   embarked  1307 non-null   object
dtypes: int64(4), object(6)
memory usage: 102.4+ KB

In [8]:
from sklearn.impute import SimpleImputer

In [9]:
impu = SimpleImputer()

In [10]:
data['age'] = impu.fit_transform(data['age'].values.reshape(-1,1))

In [11]:
data.head(10)

   pclass  survived  ...      fare embarked
0       1         1  ...  211.3375        S
1       1         1  ...    151.55        S
2       1         0  ...    151.55        S
3       1         0  ...    151.55        S
4       1         0  ...    151.55        S
5       1         1  ...     26.55        S
6       1         1  ...   77.9583        S
7       1         0  ...         0        S
8       1         1  ...   51.4792        S
9       1         0  ...   49.5042        C

[10 rows x 10 columns]

In [12]:
data['pclass'].value_counts()

3    709
1    323
2    277
Name: pclass, dtype: int64

In [13]:
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'embarked'],
      dtype='object')

In [14]:
data['survived'].value_counts()

0    809
1    500
Name: survived, dtype: int64

In [15]:
data.drop('name',axis=1,inplace = True)

In [16]:
data['sex'].value_counts()

male      843
female    466
Name: sex, dtype: int64

In [19]:
cols = ['sibsp','parch','ticket','fare','embarked']

for i in cols:
  print(i," : ",data[i].value_counts())

sibsp  :  0    891
1    319
2     42
4     22
3     20
8      9
5      6
Name: sibsp, dtype: int64
parch  :  0    1002
1     170
2     113
3       8
5       6
4       6
9       2
6       2
Name: parch, dtype: int64
ticket  :  CA. 2343    11
1601         8
CA 2144      8
3101295      7
PC 17608     7
            ..
113791       1
315094       1
3101264      1
PC 17754     1
363272       1
Name: ticket, Length: 929, dtype: int64
fare  :  8.05       60
13         59
7.75       55
26         50
7.8958     49
           ..
26.3875     1
32.3208     1
7.575       1
27.4458     1
8.3625      1
Name: fare, Length: 281, dtype: int64
embarked  :  S    914
C    270
Q    123
Name: embarked, dtype: int64

In [20]:

data.drop('ticket',axis=1,inplace=True)

In [21]:
data.dropna(axis=0,inplace=True)

In [22]:
from sklearn.preprocessing import LabelEncoder

In [23]:
data['fare']= data['fare'].astype('float')

In [25]:
cat=['sex','embarked']

In [27]:
for i in cat:
    le= LabelEncoder()
    data[i]= le.fit_transform(data[i])

In [28]:
from sklearn.preprocessing import minmax_scale

In [29]:
num=['age','fare']
for i in num:
    data[i]= minmax_scale(data[i])

In [30]:
data.head()

   pclass  survived  sex       age  sibsp  parch      fare  embarked
0       1         1    0  0.361169      0      0  0.412503         2
1       1         1    1  0.009395      1      2  0.295806         2
2       1         0    0  0.022964      1      2  0.295806         2
3       1         0    1  0.373695      1      2  0.295806         2
4       1         0    0  0.311064      1      2  0.295806         2

In [32]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(data.drop('survived',axis=1), data['survived'], test_size=0.2, random_state=42)



from sklearn.tree import DecisionTreeClassifier

model= DecisionTreeClassifier(max_depth=6)

model.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=6, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [33]:
y_train_pred=model.predict(X_train)

In [35]:
from sklearn.metrics import accuracy_score
accuracy_score(y_train,y_train_pred)

0.8457854406130269